Table of Contents
 Class LineSegment2D
Namespace
IdeaRS.OpenModel.Geometry2D
Assembly
IdeaRS.OpenModel.dll
Represents a line segment in two-dimensional space.
[OpenModelClass("CI.Geometry2D.LineSegment2D,CI.Geometry2D")]
[DataContract]
public class LineSegment2D : Segment2D
Inheritance
object
OpenObject
Segment2D
LineSegment2D
Inherited Members
 Segment2D.EndPoint
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
 Edit this page